benchmark-results/latest/perf/latest-host-kernel-1kb-perf-retry-20260712_221213/latest-host-kernel-1kb-perf-retry-20260712_221213.wrk.txt
Running 5s test @ https://127.0.0.1:4043/index.html
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.28ms   11.88ms 195.01ms   98.02%
    Req/Sec     5.61k   630.69     5.96k    97.92%
  54144 requests in 5.02s, 65.68MB read
Requests/sec:  10776.56
Transfer/sec:     13.07MB